{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "output_shape": null, "trainable": true, "function_type": "lambda", "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-d4b83f66a336>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "border_mode": "valid", "nb_row": 5, "activation": "linear", "b_constraint": null, "trainable": true, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_1", "W_constraint": null, "nb_col": 5, "W_regularizer": null, "nb_filter": 24}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "border_mode": "valid", "nb_row": 5, "activation": "linear", "b_constraint": null, "trainable": true, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_2", "W_constraint": null, "nb_col": 5, "W_regularizer": null, "nb_filter": 36}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "border_mode": "valid", "nb_row": 5, "activation": "linear", "b_constraint": null, "trainable": true, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_3", "W_constraint": null, "nb_col": 5, "W_regularizer": null, "nb_filter": 48}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "border_mode": "valid", "nb_row": 3, "activation": "linear", "b_constraint": null, "trainable": true, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_4", "W_constraint": null, "nb_col": 3, "W_regularizer": null, "nb_filter": 64}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "border_mode": "valid", "nb_row": 3, "activation": "linear", "b_constraint": null, "trainable": true, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_5", "W_constraint": null, "nb_col": 3, "W_regularizer": null, "nb_filter": 64}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 1164, "activity_regularizer": null, "init": "he_normal", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_1", "W_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 100, "activity_regularizer": null, "init": "he_normal", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_2", "W_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 50, "activity_regularizer": null, "init": "he_normal", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_3", "W_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 10, "activity_regularizer": null, "init": "he_normal", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_4", "W_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "init": "he_normal", "bias": true, "input_dim": null, "activation": "linear", "b_constraint": null, "trainable": true, "name": "dense_5", "W_constraint": null, "W_regularizer": null}}], "keras_version": "1.1.2"}