{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"trainable": true, "output_shape": null, "output_shape_type": "raw", "name": "lambda_3", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-e629906f87f4>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_11", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 24, "nb_row": 5, "subsample": [2, 2], "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_19"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_12", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 36, "nb_row": 5, "subsample": [2, 2], "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_20"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_13", "dim_ordering": "tf", "nb_col": 5, "nb_filter": 48, "nb_row": 5, "subsample": [2, 2], "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_21"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_14", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "nb_row": 3, "subsample": [1, 1], "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_22"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "name": "convolution2d_15", "dim_ordering": "tf", "nb_col": 3, "nb_filter": 64, "nb_row": 3, "subsample": [1, 1], "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_23"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "name": "dense_11", "W_regularizer": null, "output_dim": 1164, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_24"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "name": "dense_12", "W_regularizer": null, "output_dim": 100, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_25"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "name": "dense_13", "W_regularizer": null, "output_dim": 50, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_26"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "name": "dense_14", "W_regularizer": null, "output_dim": 10, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "he_normal"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_27"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "bias": true, "name": "dense_15", "W_regularizer": null, "output_dim": 1, "activity_regularizer": null, "b_constraint": null, "input_dim": null, "init": "he_normal"}}]}